In [60]:

import pandas as pd
from scipy import stats
import numpy as np
import pandas as pd
import matplotlib as plt

In [61]:
# Make a reference to thecsv file path
csv_path = "NationalAnxietySurvey.csv"

# Import the books.csv file as a DataFrame
NAS_df = pd.read_csv(csv_path)
NAS_df.head()

,id,age,sex,literacy,martialstatus,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease,feel
0,1.0,35.0,f,y,y,n,y,2,y,n,n,NaN
1,2.0,45.0,m,y,y,y,y,5,n,y,n,NaN
2,3.0,35.0,m,y,y,n,y,0,n,n,y,NaN
3,4.0,56.0,m,y,y,n,y,1,n,n,n,NaN
4,5.0,45.0,m,y,y,n,y,0,y,n,n,NaN

In [62]:
NAS_df.columns.values

array(['id', 'age', 'sex', 'literacy ', 'martialstatus',
       'recentbravement', 'employementstatus',
       'socialeconomicstatus(0-5)', 'familyhistory', 'anyaddiction',
       'anychronicdesease', 'feel'], dtype=object)

In [82]:
NAS_df_c = NAS_df.drop(columns=['feel', 'martialstatus'])
NAS_df_c

,id,age,sex,literacy,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease
0,1.0,35.0,f,y,n,y,2,y,n,n
1,2.0,45.0,m,y,y,y,5,n,y,n
2,3.0,35.0,m,y,n,y,0,n,n,y
3,4.0,56.0,m,y,n,y,1,n,n,n
4,5.0,45.0,m,y,n,y,0,y,n,n
...,...,...,...,...,...,...,...,...,...,...
1967,NaN,NaN,NaN,NaN,NaN,NaN,5,NaN,NaN,NaN
1968,NaN,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN
1969,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN
1970,NaN,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,NaN
1971,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,NaN,NaN

In [83]:

#count Nulls
print(" \nCount total NaN at each column in a DataFrame : \n\n", 
      NAS_df_c.isnull().sum())

Count total NaN at each column in a DataFrame :

 id                           10
age                          10
sex                          10
literacy                     10
recentbravement              10
employementstatus            10
socialeconomicstatus(0-5)     0
familyhistory                10
anyaddiction                 10
anychronicdesease            10
dtype: int64

In [84]:
#Remove nulls

# removing the nulls 

NAS_df_c.dropna(subset=['id'], inplace=True)
NAS_df_c.count()

id                           1962
age                          1962
sex                          1962
literacy                     1962
recentbravement              1962
employementstatus            1962
socialeconomicstatus(0-5)    1962
familyhistory                1962
anyaddiction                 1962
anychronicdesease            1962
dtype: int64

In [87]:
NAS_df_c.tail()

,id,age,sex,literacy,recentbravement,employementstatus,socialeconomicstatus(0-5),familyhistory,anyaddiction,anychronicdesease
1957,1958.0,35.0,m,y,n,y,1,y,n,n
1958,1959.0,35.0,m,y,n,y,1,y,n,n
1959,1960.0,35.0,m,y,n,y,4,y,n,n
1960,1961.0,35.0,m,y,n,y,5,y,n,n
1961,1962.0,35.0,m,y,n,y,3,y,n,n